tutorials/oldd/eulerVortex.twitch/eulerVortex.cyclic.twitch.rPAF/system/decomposeParDict
numberOfSubdomains 4;
method simple/hierarchical/metis/manual;
